README.org
# Created 2019-10-03 Thu 07:57
#+OPTIONS: toc:nil d:nil
#+OPTIONS: html-postamble:nil toc:nil d:nil
#+TITLE: Literate Agda with Org-mode
#+DATE: 2018-11-03
#+AUTHOR: Musa Al-hassy
#+export_file_name: README.org

An Emacs mode for working with
Agda code in an Org-mode like fashion, more or less.

The following can also be read as an outdate [[https://alhassy.github.io/literate/][blog post]].

#+toc: headlines 2

#+description: An Org-mode utility for Agda.
#+description: An Emacs mode for working with Agda code in an Org-mode like fashion, more or less.
#+startup: indent
#+categories: Agda Org Emacs
#+image: ../assets/img/org_logo.png
#+source: https://raw.githubusercontent.com/alhassy/org-agda-mode/master/literate.lagda

#+property: header-args :tangle no

#+begin_center
*Abstract*
#+end_center

[[https://en.wikipedia.org/wiki/Literate_programming][Literate Programming]] is essentially the idea that code is enclosed in documentation
rather than the comments being surrounded by code. The idea is that software
ought to be written like an essay to be read by a human; from this, code for the
machine can then be extracted.

The articles on this blog are meant to be in such a format and as such
I use [[https://www.offerzen.com/blog/literate-programming-empower-your-writing-with-emacs-org-mode][Org-mode]] as my markup for producing the HTMLs and PDFs.

This article aims to produce an Org-friendly approach to working
with the [[http://wiki.portal.chalmers.se/agda/pmwiki.php][Agda language]], which is special in comparison to many other languages:
Coding is interactive via holes and it permits almost any sequence of characters
as a legal lexeme thereby rendering a static highlighting theme impossible.

The result of this Elisp exploration is that by ~C-x C-a~
we can toggle into Agda-mode and use its interactive features to construct our program;
then return to an Org-mode literate programming style afterwards with
another ~C-x C-a~
---/both translations remember the position we're working at and allow the editing features of their respective modes!/
Moreover, we also allow user-defined colouring.

Jump to [[#installation]] to quickly get and use the setup.

( Thanks to [[https://github.com/armkeh][Mark Armstrong]] for significant testing and contributions! )

#+html: <!--
#+begin_src emacs-lisp
;; This file is generated from literate.lagda.
#+end_src
#+begin_src emacs-lisp :tangle org-agda-mode.el
;; This file is generated from literate.lagda.
#+end_src
#+html: -->

#+begin_quote
- [[#abstract][Abstract]]
- [[#agda-now-supports-org-files----not-really][“Agda now supports org files” ---Not Really]]
- [[#agda-syntax-highlighting][Agda Syntax Highlighting]]
  - [[#keywords][Keywords]]
  - [[#the-generic-mode-definition][The ~generic-mode~ Definition]]
  - [[#user-defined-colouring][User-defined Colouring]]
- [[#lagda-to-org-and-org-to-lagda][(~lagda-to-org~) and (~org-to-lagda~)]]
- [[#example][Example]]
- [[#summary][Summary]]
- [[#installation][Installation]]
- [[#sources-consulted][Sources Consulted]]
#+end_quote

* “Agda now supports org files” ---Not Really

As of Agda 2.6.0 ---which came after this article was originally written---
there is now support for literate Org-mode support using ~agda2~ org-src blocks.

The [[https://github.com/agda/agda/pull/3548][pull request]] was by one of my then students who found the use of this ‘org-agda’
setup to be sufficiently useful to be appreciated by the whole Agda community out-of-the-box.

Unfortunately, currently working with a ~myfile.lagda.org~
comes with discouraging compromises between the Org- and Agda-modes. Namely:
1. Interactivity with Agda holes is /not/ supported.
2. The full editorial capabilities of Org-mode are limited since some
   features clash with those of Agda-mode.

The solution outline here is not to limit or compromise each role, but rather
provide both and instead allow the user, you, to control when you would like
to be /documenting vs. developing/ ---the resulting system is sufficiently fast
to toggle between the modes; e.g., the somewhat large categorical development
[[https://alhassy.github.io/PathCat/][Graphs are to categories as lists are to monoids]] is written literately using org-agda.

Besides the core capability to switch between the different modes, we also provide
an elementary yet /extensible/ syntax colouring mechanism for Agda's non-standard highlighting.

* Agda Syntax Highlighting

We produce a new mode, calling it ~ob-agda-mode~,
so that Org-mode blocks marked with ~ob-agda~ will have Agda /approximated/
syntax. By default, if an Emacs major-mode ~<lang>-mode~ exists,
then blocks marked with ~<lang>~ use that major-mode for editing.

#+begin_src emacs-lisp :tangle literate.el :comments link
;; To use generic-mode later below.
(require 'generic-x)
#+end_src

The “ob” is short for “org-babel” since we also wish to provide
Babel support for Agda. Using ~ob-agda~ marked blocks is awkward and exposes
some of our implementation, we will instead support an alias ~agda~ which refers to ~ob-agda~.

We can use the ~org-src-lang-modes~ variable to map any ---possibly more friendly or suggestive--- identifier to a language major mode.
#+begin_src emacs-lisp :tangle literate.el :comments link
(add-to-list 'org-src-lang-modes '("agda" . ob-agda))
#+end_src

** Keywords

We look at the ~agda2-highlight.el~ source file from the Agda repository
for colours of keywords and reserved symbols such as ~=, ∀,~ etc.

#+begin_src emacs-lisp
(defface agda2-highlight-keyword-face
  '((t (:foreground "DarkOrange3")))
  "The face used for keywords."
    :group 'font-lock-faces)

(setq font-lock-keyword-face 'agda2-highlight-keyword-face)

(defface agda2-highlight-symbol-face
  '((((background light)) (:foreground "gray25"))
    (((background dark))  (:foreground "gray75")))
  "The face used for symbols like forall, =, as, ->, etc."
  :group 'font-lock-faces)
#+end_src

From Agda's [[https://agda.readthedocs.io/en/v2.5.4.1/language/lexical-structure.html?highlight=keywords][“read the docs”]] website, we obtain the keywords for the language:

#+begin_src emacs-lisp
(setq org-agda-keywords
  '("=" "|" "->" "→" ":" "?" "\\" "λ" "∀" ".." "..." "abstract" "codata"
  "coinductive" "constructor" "data" "do" "eta-equality" "field"
  "forall" "hiding" "import" "in" "inductive" "infix" "infixl"
  "infixr" "instance" "let" "macro" "module" "mutual" "no-eta-equality"
  "open" "overlap" "pattern" "postulate" "primitive" "private" "public"
  "quote" "quoteContext" "quoteGoal" "quoteTerm" "record" "renaming"
  "rewrite" "Set" "syntax" "tactic" "unquote" "unquoteDecl" "unquoteDef"
  "using" "where" "with"))
#+end_src

