README.md
<h1> org-agda </h1>

An Emacs mode for working with
Agda code in an Org-mode like fashion, more or less.

The following can also be read as a [blog post](https://alhassy.github.io/literate/).


# Table of Contents

1.  [“Agda now supports org files” &#x2014;Not Really](#orge0028ed)
2.  [Agda Syntax Highlighting](#org6e7e25f)
    1.  [Keywords](#orgbc189d9)
    2.  [The `generic-mode` Definition](#orgd975c1e)
    3.  [User-defined Colouring](#org76a9760)
3.  [(`lagda-to-org`) and (`org-to-lagda`)](#org9f9594f)
4.  [Example](#orgfc76e4a)
5.  [Summary](#org2c2cd30)
6.  [Sources Consulted](#org75a5a73)

**TODO:** require dash and s? document these dependencies.

<div class="org-center">
**Abstract**
</div>

[Literate Programming](https://en.wikipedia.org/wiki/Literate_programming) is essentially the idea that code is enclosed in documentation
rather than the comments being surrounded by code. The idea is that software
ought to be written like an essay to be read by a human; from this, code for the
machine can then be extracted.

The articles on this blog are meant to be in such a format and as such
I use [Org-mode](https://www.offerzen.com/blog/literate-programming-empower-your-writing-with-emacs-org-mode) as my markup for producing the HTMLs and PDFs.

This article aims to produce an Org-friendly approach to working
with the [Agda language](http://wiki.portal.chalmers.se/agda/pmwiki.php), which is special in comparison to many other languages:
Coding is interactive via holes and it permits almost any sequence of characters
as a legal lexeme thereby rendering a static highlighting theme impossible.

The result of this Elisp exploration is that by `C-x C-a`
we can toggle into Agda-mode and use its interactive features to construct our program;
then return to an Org-mode literate programming style afterwards with
another `C-x C-a`
---*both translations remember the position we're working at and allow the editing features of their respective modes!*
Moreover, we also allow user-defined colouring.

( Thanks to [Mark Armstrong](https://github.com/armkeh) for significant testing and contributions! )

<!--

    ;; This file is generated from literate.lagda.

    ;; This file is generated from literate.lagda.

-->


<a id="orge0028ed"></a>

# “Agda now supports org files” &#x2014;Not Really

As of Agda 2.6.0 &#x2014;which came after this article was originally written&#x2014;
there is now support for literate Org-mode support using `agda2` org-src blocks.

The [pull request](https://github.com/agda/agda/pull/3548) was by one of my then students who found the use of this ‘org-agda’
setup to be sufficiently useful to be appreciated by the whole Agda community out-of-the-box.

Unfortunately, currently working with a `myfile.lagda.org`
comes with discouraging compromises between the Org- and Agda-modes. Namely:

1.  Interactivity with Agda holes is *not* supported.
2.  The full editorial capabilities of Org-mode are limited since some
    features clash with those of Agda-mode.

The solution outline here is not to limit or compromise each role, but rather
provide both and instead allow the user, you, to control when you would like
to be *documenting vs. developing* &#x2014;the resulting system is sufficiently fast
to toggle between the modes; e.g., the somewhat large categorical development
[Graphs are to categories as lists are to monoids](https://alhassy.github.io/PathCat/) is written literately using org-agda.

Besides the core capability to switch between the different modes, we also provide
an elementary yet *extensible* syntax colouring mechanism for Agda's non-standard highlighting.


<a id="org6e7e25f"></a>

# Agda Syntax Highlighting

We produce a new mode, calling it `ob-agda-mode`,
so that Org-mode blocks marked with `ob-agda` will have Agda *approximated*
syntax. By default, if an Emacs major-mode `<lang>-mode` exists,
then blocks marked with `<lang>` use that major-mode for editing.

    ;; To use generic-mode later below.
    (require 'generic-x)

The “ob” is short for “org-babel” since we also wish to provide
Babel support for Agda. Using `ob-agda` marked blocks is awkward and exposes
some of our implementation, we will instead support an alias `agda` which refers to `ob-agda`.

We can use the `org-src-lang-modes` variable to map any &#x2014;possibly more friendly or suggestive&#x2014; identifier to a language major mode.

    (add-to-list 'org-src-lang-modes '("agda" . ob-agda))


<a id="orgbc189d9"></a>

## Keywords

We look at the `agda2-highlight.el` source file from the Agda repository
for colours of keywords and reserved symbols such as `=, ∀,` etc.

    (defface agda2-highlight-keyword-face
      '((t (:foreground "DarkOrange3")))
      "The face used for keywords."
	:group 'font-lock-faces)

    (setq font-lock-keyword-face 'agda2-highlight-keyword-face)

    (defface agda2-highlight-symbol-face
      '((((background light)) (:foreground "gray25"))
	(((background dark))  (:foreground "gray75")))
      "The face used for symbols like forall, =, as, ->, etc."
      :group 'font-lock-faces)

From Agda's [“read the docs”](https://agda.readthedocs.io/en/v2.5.4.1/language/lexical-structure.html?highlight=keywords) website, we obtain the keywords for the language:

    (setq org-agda-keywords
      '("=" "|" "->" "→" ":" "?" "\\" "λ" "∀" ".." "..." "abstract" "codata"
      "coinductive" "constructor" "data" "do" "eta-equality" "field"
      "forall" "hiding" "import" "in" "inductive" "infix" "infixl"
      "infixr" "instance" "let" "macro" "module" "mutual" "no-eta-equality"
      "open" "overlap" "pattern" "postulate" "primitive" "private" "public"
      "quote" "quoteContext" "quoteGoal" "quoteTerm" "record" "renaming"
      "rewrite" "Set" "syntax" "tactic" "unquote" "unquoteDecl" "unquoteDef"
      "using" "where" "with"))
