README.md


<a id="orgd975c1e"></a>

## The `generic-mode` Definition

Agda colouring is approximated as defined below, but a convention is made:
Function symbols begin with a lower case letter, whereas type symbols begin
with a capital letter. Otherwise, I would need to resort to Agda's mechanism
for determining whether a name is a type or not:

<div class="org-center">
*Parsing is Typechecking!*
</div>

    ; (defvar org-agda-extra-word-colours nil "other words that user of org-mode wants coloured, along with their specified font-lock-type-face")

    (define-generic-mode

	'ob-agda-mode                      ;; name of the mode

	(list '("{-" . "-}"))               ;; comments delimiter

	org-agda-keywords

	;; font lock list: Order of colouring matters;
	;; the numbers refer to the subpart, or the whole(0), that should be coloured.

	(-concat  ;; ★★★★★★★★★★★★★★ org-agda-extra-word-colours is a free variable, user should define it /before/ loading org-agda-mode ★★★★★★★★★★★★★★
		   (if (boundp (quote org-agda-extra-word-colours)) org-agda-extra-word-colours nil)
	(list

	 ;; To begin with, after "module" or after "import" should be purple
	 ;; Note the SPACE below.
	 '("\\(module\\|import\\) \\([a-zA-Z0-9\-_\.]+\\)" 2 '((t (:foreground "purple"))))

	 ;; Agda special symbols: as
	 '(" as" 0 'agda2-highlight-symbol-face)

	 ;; Type, and constructor, names begin with a capital letter  --personal convention.
	 ;; They're preceded by either a space or an open delimiter character.
	 '("\\( \\|\s(\\)\\([A-Z]+\\)\\([a-zA-Z0-9\-_]*\\)" 0 'font-lock-type-face)
	 '("ℕ" 0 'font-lock-type-face)

	 ;; variables & function names, as a personal convention, begin with a lower case
	 '("\\([a-z]+\\)\\([a-zA-Z0-9\-_]*\\)" 0 '((t (:foreground "medium blue"))))

	 ;; colour numbers
	 '("\\([0-9]+\\)" 1   '((t (:foreground "purple"))))

	 ;; other faces to consider:
	 ;; 'font-lock-keyword-face 'font-lock-builtin-face 'font-lock-function-name-face
	 ;; 'font-lock-variable-name-face 'font-lock-constant-face
	 ))

	 ;; files that trigger this mode
	 nil

	 ;; any other functions to call
	 nil

	 ;; doc string
	 "My custom Agda highlighting mode for use *within* Org-mode."
    )

    (provide 'ob-agda-mode)

    ; (describe-symbol 'define-generic-mode)
    ; (describe-symbol 'font-lock-function-name-face)

I do not insist that `org-agda-mode` be activated on any particular files by default.

Here is an example code block that obtains this colouring schema.

    module literate where

    data ℕ : Set where
      Zero : ℕ
      Succ : ℕ → ℕ

    double : ℕ → ℕ
    double Zero = Zero
    double (Succ n) = Succ (Succ (double n))

    {- lengthy
	  multiline
	    comment -}

    {- No one line comment colouring … Yet -}

    open import Data.Nat as Lib

    camelCaseIdentifier-01 : Lib.ℕ
    camelCaseIdentifier-01 = let it = 1234 in it

Next, we turn to supporting Agda interactivity with holes.


<a id="org76a9760"></a>

## User-defined Colouring

Since true Agda colouring requires type-checking, it is desirable to allow the user to
input colouring for their own identifiers. Such <a id="orgbdb5542">user-defined colouring</a> will be
via the delightful org-mode interface: A super simple intuitive table ♥‿♥

Anywhere in their buffer, the user should have a table with a column for identifiers
and the colours they should have, as follows.

    #+RESULTS: ob-agda/colours
    | one   | keyword       |
    | two   | builtin       |
    | three | function-name |
    | four  | variable-name |
    | five  | constant      |

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">one</td>
<td class="org-left">keyword</td>
</tr>


<tr>
<td class="org-left">twoish</td>
<td class="org-left">builtin</td>
</tr>


<tr>
<td class="org-left">three</td>
<td class="org-left">function-name</td>
</tr>


<tr>
<td class="org-left">four</td>
<td class="org-left">variable-name</td>
</tr>


<tr>
<td class="org-left">five</td>
<td class="org-left">constant</td>
</tr>
</tbody>
</table>

Which yields the following colouring,

    one   = Set
    two   = Set
    three = Set
    four  = Set
    five  = Set

(load-file "literate.el")

We implement this as follows. We produce a function that realises such colouring assignments:

    (defun ob-agda/add-colour (word colour)

       "
	Refresh the ob-agda-mode to have the new ‘colour’ for ‘word’ in agda blocks.

	+ ‘word’ is a string representing an Agda identifier.

	+ ‘colour’ is either a symbol from ‘keyword’, ‘builtin’, ‘function-name’,
	   ‘variable-name’, ‘constant’.
       "

       ;; We only declare org-agda-extra-word-colours if the user needs it.
       ;; If we declare it in the file, as nil, then it will always be nil before
       ;; the ob-agda-mode is defined and so later changes to this variable will not take effect.
       ;;
       (unless (boundp (quote org-agda-extra-word-colours)) (setq org-agda-extra-word-colours nil))

       ;; Discard existing colour-scheme.
       (unload-feature 'ob-agda-mode)

       ;; Add new colour
       (if (-contains? '(keyword builtin function-name variable-name constant) colour)

	    (add-to-list 'org-agda-extra-word-colours
	       `(,word 0 ,(intern (concat "font-lock-" (symbol-name colour) "-face"))))

	    (message-box "colour %s" colour)
	    (add-to-list 'org-agda-extra-word-colours
	       `(,word 0 ,colour))
       )

       ;; Load the new altered scheme.
       (require 'ob-agda-mode "~/org-agda-mode/literate.el")

    )

    (add-to-list 'org-agda-extra-word-colours '("typeclass" 0 'agda2-highlight-keyword-face))
    (add-to-list 'org-agda-extra-word-colours '("PackageFormer" 0 'font-lock-type-face))
    (add-to-list 'org-agda-extra-word-colours '("_⨾_" 0 'font-lock-type-face))
    (add-to-list 'org-agda-extra-word-colours '("assoc" 0 'font-lock-type-face))

    ; (ob-agda/add-colour "newkeyword" 'agda2-highlight-keyword-face)
    (ob-agda/add-colour "newkeyword" 'builtin)
    (ob-agda/add-colour "newkeyword" 'constant)
    (ob-agda/add-colour "newkeyword" 'function-name)

Then lookup that user provided table, if it is there, and use it.

    (defun ob-agda/update-colours ()
     "Searchs current buffer for an ob-agda/colours named result table
      then uses that to update the colour scheme.
     "
     (interactive)
    (ignore-errors
    (save-excursion
      (org-babel-goto-named-result "ob-agda/colours")
      (forward-line)
      ; (setq _it (org-table-to-lisp))
      (dolist (elem (org-table-to-lisp) org-agda-extra-word-colours)
	(ob-agda/add-colour (car elem) (intern (cadr elem))))
    ))
    )

    ob-agda/update-colours
