README.org
* (~lagda-to-org~) and (~org-to-lagda~)

Previously, Agda would not typecheck a non-~lagda~, or non-~agda~, file therefore
I could not use Org-mode multiple mode settings.

Recent versions of Agda will typecheck files with other extensions,
but as of 2.6.0, the interactive mode does not work on such files.

I will instead merely
swap the syntax of the modes then reload the desired mode.
--it may not be ideal, but it does what I want in a fast enough fashion.

In order to maintain position when switching back to Org-mode,
I define a function which not only goes to the appropriate line,
but unfolds the document to show that line.

#+begin_src emacs-lisp :tangle literate.el :comments link
(defun org-goto-line (line)
  "Go to the indicated line, unfolding the parent Org header.

   Implementation: Go to the line, then look at the 1st previous
   org header, now we can unfold it whence we do so, then we go
   back to the line we want to be at.
  "
  (goto-line line)
  (org-back-to-heading 1)
  (org-cycle)
  (goto-line line)
  )
#+end_src

Below we put together a way to make rewrites ~⟨pre⟩⋯⟨post⟩ ↦ ⟨newPre⟩⋯⟨newPost⟩~
then use that with the rewrite tokens being ~#+BEGIN_SRC~ and ~╲begin{code}~ for
literate Agda, as well as their closing partners.

#+begin_src emacs-lisp :tangle literate.el :comments link
(defun rewrite-ends (pre post new-pre new-post)
  "Perform the following in-buffer rewrite: ⟨pre⟩⋯⟨post⟩ ↦ ⟨newPre⟩⋯⟨newPost⟩.
  For example, for rewriting begin-end code blocks from Org-mode to something
  else, say a language's default literate mode.

  The search for the string ⟨pre⟩⋯⟨post⟩ is non-greedy, i.e. will find
  (in order) the minimal strings matching ⟨pre⟩⋯⟨post⟩.

  We insist that the ends occur at the start of a newline; otherwise no
  rewrite is made. Note the “^” regexp marker below.

  In the arguments, only symbol `\` needs to be escaped.
  "
  (let ((rx-pre  (concat "\\(^" (regexp-quote pre)  "\\)"))
        (rx-post (concat "\\(^" (regexp-quote post) "\\)"))
        ;; Code to match any characters (including newlines) based on https://www.emacswiki.org/emacs/MultilineRegexp
        ;; This version requires we end in a newline,
        ;; and uses the “non-greedy” * operator, *?, so we will match the minimal string.
        (body "\\(.*\n\\)*?"))
    (goto-char (point-min))
    (while (re-search-forward (concat rx-pre body rx-post) nil t) ;; nil to search whole buffer, t to not error
      ;; Matched string 1 is the pre, matched string 3 is the post.
      ;; Optionals: fixed-case, literal, use buffer, substring
      (replace-match new-pre  t t nil 1)
      (replace-match new-post t t nil 3)
      )
    )
  )
#+end_src

The two rewriting utilities:

#+begin_src emacs-lisp :tangle literate.el :comments link
(defun lagda-to-org ()
  "Transform literate Agda blocks into Org-mode source blocks.
   Use haskell as the Org source block language since I do not have nice colouring otherwise.
  "
  (interactive)
  (let ((here-line (line-number-at-pos)) ;; remember current line
        (here-column (current-column))
        (enable-local-variables :safe)
        )
    (rewrite-ends "\\begin{code}"              "\\end{code}"
                  "#+BEGIN_SRC agda"       "#+END_SRC")
    (rewrite-ends "\\begin{spec}"              "\\end{spec}"
                  "#+BEGIN_EXAMPLE agda"   "#+END_EXAMPLE")
    (org-mode)
    (org-goto-line here-line) ;; defined above
    (move-to-column here-column)
  )
  (message "Welcome to Org-mode, %s!" user-full-name)
)

(defun org-to-lagda ()
  "Transform Org-mode source blocks into literate Agda blocks.
   Use haskell as the Org source block language since I do not have nice colouring otherwise.
  "
  (interactive)
  (let ((here-line (line-number-at-pos)) ;; remember current line
        (here-column (current-column))  ;; and current column
        (enable-local-variables :safe))

    (rewrite-ends "#+BEGIN_SRC agda"       "#+END_SRC"
                  "\\begin{code}"              "\\end{code}")
    (rewrite-ends "#+BEGIN_EXAMPLE agda"   "#+END_EXAMPLE"
                  "\\begin{spec}"              "\\end{spec}")
    (agda2-mode)
    (sit-for 0.1) ;; necessary for the slight delay between the agda2 commands
    (agda2-load)
    (goto-line here-line)
    (move-to-column here-column)
  )
   (message "Welcome to Agda-mode, %s!" user-full-name)
)
#+end_src

#+results:
: org-to-lagda


*Notice!* The toggling utilities automatically enable all /safe/ local variables
in an file ---c.f., the ~(enable-local-variables :all)~ lines above.
Many of our files tend to have local variables and that is the reason
we allow us.

Handy-dandy shortcuts, which are alternated on mode change:
#+begin_src emacs-lisp :tangle literate.el :comments link
(add-hook 'org-mode-hook
          (lambda () (local-set-key (kbd "C-x C-a") 'org-to-lagda)))

(add-hook 'agda2-mode-hook
          (lambda ()
            (local-set-key (kbd "C-x C-a") 'lagda-to-org)
            (local-set-key (kbd "C-c C-v C-d")
                           (lambda (prefix)
                             (interactive "P") ;; Places value of universal argument into: current-prefix-arg
                             (insert (if (identity current-prefix-arg)
                                         "\n\\begin{spec}\n\n\\end{spec}"
                                       "\n\\begin{code}\n\n\\end{code}"))
                             (forward-line -1)))))
#+end_src

Org-mode, by default, lets us create a source block using ~C-c C-v C-d~, so we bring
this incantation to Agda-mode as well as having ~C-u C-c C-v C-d~ produce a ~spec~-environment.

