README.org
* Example

#+html: <!--
#+begin_example emacs-lisp
(unload-feature 'org-agda-mode)
(load-file "org-agda-mode.el")
#+end_example
#+html: -->

Here's some sample fragments, whose editing can be turned on with ~C-x C-a~.
#+begin_src org-agda
postulate magic : Set

hole : magic
hole = {!!}
#+end_src

Here's a literate Agda ~spec~-ification environment, which corresponds to an Org-mode ~EXAMPLE~ block.
#+begin_example org-agda
module this-is-a-spec {A : Set} (_≤_ : A → A → Set) where

  maximum-specfication : (candidate : A) → Set
  maximum-specfication c = ?
#+end_example

* Summary

We now have the utility functions:

| _Command_ | _Action_                                                      |
| ~C-x C-a~ | transform org ~org-agda~ blocks to literate Agda blocs        |
| ~C-x C-a~ | transform literate Agda code delimiters to org ~org-agda~ src |

This was fun: I learned a lot of elisp!
Hopefully I can make use of this, in the small, if not in the large
--in which case I'll need to return to the many ~COMMENT~-ed out sections
in this document.

* Installation
Add the following to the top of your Emacs configuration file, i.e., the ~~/.emacs~ file.
#+begin_src emacs-lisp
(progn

(require 'package)
(push '("melpa-stable" . "http://stable.melpa.org/packages/") package-archives)
(package-initialize)
(package-refresh-contents)

;; Obtain & setup installation interface.
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)

;; Necessary libraries for producing the system.
(use-package s)                  ;; “The long lost Emacs string manipulation library”.
(use-package dash)               ;; “A modern list library for Emacs”.

;; Next, obtain the Elisp file, load it, and attach it to Agda.
;; (shell-command "cp ~/org-agda-mode/literate.el ~/.emacs.d/literate.el")
(unless (file-exists-p "~/.emacs.d/literate.el")
  (shell-command (concat "curl "
    "https://raw.githubusercontent.com/alhassy/org-agda-mode/master/literate.el"
    ">> ~/.emacs.d/literate.el")))
(load-file "~/.emacs.d/literate.el")
;; (add-hook 'agda2-mode-hook (lambda () (load-file "~/.emacs.d/literate.el")))

;; Uncomment out the last line above if you want support for literate org-agda blocks
;; to ALWAYS be active on .lagda files.

;; You likely have this in your ~/.emacs file already
(load-file (let ((coding-system-for-read 'utf-8))
                (shell-command-to-string "/usr/local/bin/agda-mode locate")))

) ;; ends the progn at the top.
#+end_src

1. Make a new ~test.lagda~ file.
   #+begin_src org :tangle test.lagda
   # -*- org -*-
   #
   # (load-file "~/.emacs.d/literate.el")

   ,* Example src

   Press C-c C-v C-d to make src code blocks.

   words
   \begin{code}
   module test where
   \end{code}
   more

   ,* Example spec

   In Agda mode, press C-u C-c C-v C-d to make spec blocks.

   then
   \begin{spec}
   e : τ
   \end{spec}
   bye
   #+end_src

2. Load the ~literate.el~ file.

3. Now ~C-x C-a~ to switch to Agda mode and load the module.

* Sources Consulted

- [[http://www.ergoemacs.org/emacs/elisp_syntax_coloring.html][How to Write a Emacs Major Mode for Syntax Coloring]]
- [[https://stackoverflow.com/questions/3887372/simplest-emacs-syntax-highlighting-tutorial][Simplest Emacs Syntax Highlighting Tutorial]]
- [[https://stackoverflow.com/questions/1063115/a-hello-world-example-for-a-major-mode-in-emacs][“Hello World” for Emacs' Major Mode Creation]]
- [[http://www.wilfred.me.uk/blog/2015/03/19/adding-a-new-language-to-emacs/][Adding A New Language to Emacs]]
- [[https://nullprogram.com/blog/2013/02/06/][How to Make an Emacs Minor Mode]]
- [[https://www.offerzen.com/blog/literate-programming-empower-your-writing-with-emacs-org-mode][Literate Programming: Empower Your Writing with Emacs Org-Mode]]
  - An elegant overview of literate programming, with Org-mode, and the capabilities it offers.
- [[http://howardism.org/Technical/Emacs/literate-programming-tutorial.html][Introduction to Literate Programming]]
  - A nearly /comprehensive/ workshop on the fundamentals of literate programming with Org-mode.
