README.md


<a id="orgfc76e4a"></a>

# Example

<!--

    (unload-feature 'org-agda-mode)
    (load-file "org-agda-mode.el")

-->

Here's some sample fragments, whose editing can be turned on with `C-x C-a`.

    postulate magic : Set

    hole : magic
    hole = {!!}

Here's a literate Agda `spec`-ification environment, which corresponds to an Org-mode `EXAMPLE` block.

    module this-is-a-spec {A : Set} (_≤_ : A → A → Set) where

      maximum-specfication : (candidate : A) → Set
      maximum-specfication c = ?


<a id="org2c2cd30"></a>

# Summary

We now have the utility functions:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><span class="underline">Command</span></td>
<td class="org-left"><span class="underline">Action</span></td>
</tr>


<tr>
<td class="org-left">`C-x C-a`</td>
<td class="org-left">transform org `org-agda` blocks to literate Agda blocs</td>
</tr>


<tr>
<td class="org-left">`C-x C-a`</td>
<td class="org-left">transform literate Agda code delimiters to org `org-agda` src</td>
</tr>
</tbody>
</table>

This was fun: I learned a lot of elisp!
Hopefully I can make use of this, in the small, if not in the large
&#x2013;in which case I'll need to return to the many `COMMENT`-ed out sections
in this document.


<a id="org75a5a73"></a>

# Sources Consulted

-   [How to Write a Emacs Major Mode for Syntax Coloring](http://www.ergoemacs.org/emacs/elisp_syntax_coloring.html)
-   [Simplest Emacs Syntax Highlighting Tutorial](https://stackoverflow.com/questions/3887372/simplest-emacs-syntax-highlighting-tutorial)
-   [“Hello World” for Emacs' Major Mode Creation](https://stackoverflow.com/questions/1063115/a-hello-world-example-for-a-major-mode-in-emacs)
-   [Adding A New Language to Emacs](http://www.wilfred.me.uk/blog/2015/03/19/adding-a-new-language-to-emacs/)
-   [How to Make an Emacs Minor Mode](https://nullprogram.com/blog/2013/02/06/)
-   [Literate Programming: Empower Your Writing with Emacs Org-Mode](https://www.offerzen.com/blog/literate-programming-empower-your-writing-with-emacs-org-mode)
    -   An elegant overview of literate programming, with Org-mode, and the capabilities it offers.
-   [Introduction to Literate Programming](http://howardism.org/Technical/Emacs/literate-programming-tutorial.html)
    -   A nearly *comprehensive* workshop on the fundamentals of literate programming with Org-mode.
